#### SQL And SQLite
SQL (Structured Query Language) is a standard language for managing and manipulating relational databases. SQLite is a self-contained, serverless, and zero-configuration database engine that is widely used for embedded database systems. In this lesson, we will cover the basics of SQL and SQLite, including creating databases, tables, and performing various SQL operations.

In [1]:
import sqlite3

In [2]:
## Connect to an SQLite database
connection=sqlite3.connect('example9.db')
connection

In [4]:
cursor=connection.cursor()

In [5]:
## Create a Table
cursor.execute('''
Create Table If Not Exists employees(
    id Integer Primary Key,
    name Text Not Null,
    age Integer,
    department text
    )
''')
# id name age dept
# Syntex
# cursor.execute('''
#                create table abc(
                   
                   
                   
#                )
#                ''')

## Commit the changes
connection.commit()

In [6]:
cursor.execute('''
Select * from employees
    
''')

In [ ]:
## Insert the data in sqlite table
cursor.execute('''
Insert Into employees(name,age,department)
        values('Rajat',46,'Data Scientist')
        
''')

cursor.execute('''
INSERT INTO employees (name, age, department)
VALUES ('Bobi', 25, 'Engineering')
''')

cursor.execute('''
INSERT INTO employees (name, age, department)
VALUES ('Charu', 35, 'Finance')
''')

## commi the changes
connection.commit()

In [8]:
## Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()

## print the queried data

for row in rows:
    print(row)

(1, 'Rajat', 46, 'Data Scientist')
(2, 'Bobi', 25, 'Engineering')
(3, 'Charu', 35, 'Finance')
(4, 'Rajat', 46, 'Data Scientist')
(5, 'Bobi', 25, 'Engineering')
(6, 'Charu', 35, 'Finance')
(7, 'Rajat', 46, 'Data Scientist')
(8, 'Rana', 25, 'Engineering')
(9, 'Charu', 35, 'Finance')
(10, 'Rajat', 46, 'Data Scientist')
(11, 'Bobi', 25, 'Engineering')
(12, 'Charu', 35, 'Finance')
(13, 'Rajat', 46, 'Data Scientist')
(14, 'Bobi', 25, 'Engineering')
(15, 'Charu', 35, 'Finance')

In [9]:
## Update the data in the table
cursor.execute('''
UPDATE employees
Set name="Rana"
where id=8
''')
connection.commit()

In [12]:
## Query the data from the table
cursor.execute('Select id,name from employees')
rows=cursor.fetchall()

## print the queried data

for row in rows:
    print(row)

(1, 'Rajat')
(2, 'Bobi')
(3, 'Charu')
(4, 'Rajat')
(5, 'Bobi')
(6, 'Charu')
(7, 'Rajat')
(8, 'Rana')
(9, 'Charu')
(10, 'Rajat')
(11, 'Bobi')
(12, 'Charu')
(13, 'Rajat')
(14, 'Bobi')
(15, 'Charu')

In [13]:
## Delete the data from the table
cursor.execute('''
Delete from employees
               where name ='Bob'
''')

connection.commit()

In [14]:
## Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()

## print the queried data

for row in rows:
    print(row)

(1, 'Rajat', 46, 'Data Scientist')
(2, 'Bobi', 25, 'Engineering')
(3, 'Charu', 35, 'Finance')
(4, 'Rajat', 46, 'Data Scientist')
(5, 'Bobi', 25, 'Engineering')
(6, 'Charu', 35, 'Finance')
(7, 'Rajat', 46, 'Data Scientist')
(8, 'Rana', 25, 'Engineering')
(9, 'Charu', 35, 'Finance')
(10, 'Rajat', 46, 'Data Scientist')
(11, 'Bobi', 25, 'Engineering')
(12, 'Charu', 35, 'Finance')
(13, 'Rajat', 46, 'Data Scientist')
(14, 'Bobi', 25, 'Engineering')
(15, 'Charu', 35, 'Finance')

In [15]:
## Working Wwith Sales Data
# Connect to an SQLite database
connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()

# Create a table for sales data
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales (
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales INTEGER,
    region TEXT
)
''')

# Insert data into the sales table
sales_data = [
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product1', 150, 'East'),
    ('2023-01-04', 'Product3', 250, 'West'),
    ('2023-01-05', 'Product2', 300, 'North')
]

cursor.executemany('''
Insert into sales(date,product,sales,region)
                   values(?,?,?,?)
''',sales_data)

connection.commit()

In [22]:
# Query data from the sales table
cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')
(6, '2023-01-01', 'Product1', 100, 'North')
(7, '2023-01-02', 'Product2', 200, 'South')
(8, '2023-01-03', 'Product1', 150, 'East')
(9, '2023-01-04', 'Product3', 250, 'West')
(10, '2023-01-05', 'Product2', 300, 'North')
(11, '2023-01-01', 'Product1', 100, 'North')
(12, '2023-01-02', 'Product2', 200, 'South')
(13, '2023-01-03', 'Product1', 150, 'East')
(14, '2023-01-04', 'Product3', 250, 'West')
(15, '2023-01-05', 'Product2', 300, 'North')

In [16]:
## close the connection
connection.close()

In [23]:
# Query data from the sales table
cursor.execute('SELECT * FROM sales')
rows = cursor.fetchall()

# Print the queried data
for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')
(6, '2023-01-01', 'Product1', 100, 'North')
(7, '2023-01-02', 'Product2', 200, 'South')
(8, '2023-01-03', 'Product1', 150, 'East')
(9, '2023-01-04', 'Product3', 250, 'West')
(10, '2023-01-05', 'Product2', 300, 'North')
(11, '2023-01-01', 'Product1', 100, 'North')
(12, '2023-01-02', 'Product2', 200, 'South')
(13, '2023-01-03', 'Product1', 150, 'East')
(14, '2023-01-04', 'Product3', 250, 'West')
(15, '2023-01-05', 'Product2', 300, 'North')

In [ ]:
import sqlite3 # convert to 
import pandas as pd
db = sqlite3.connect('sales_data.db')
data = pd.read_sql_query("Select *from sales",db)
df = pd.DataFrame(data) #SQL JOIN WITH PANDAS
# df
df.describe()

              id       sales
count  15.000000   15.000000
mean    8.000000  200.000000
std     4.472136   73.192505
min     1.000000  100.000000
25%     4.500000  150.000000
50%     8.000000  200.000000
75%    11.500000  250.000000
max    15.000000  300.000000